[
  {
    "id": "simulations_guide",
    "title": "Guidelines for Emergency Simulations",
    "type": "public_guideline",
    "author": "PAHO - Pan American Health Organization",
    "summary": "This guideline provides a structured approach for planning, designing, conducting and evaluating emergency simulations and drills, primarily for public health and disaster management contexts. It describes different types of simulation activities (e.g. tabletop exercises, functional exercises, full-scale drills) and clarifies when each type is appropriate. The document explains how to define realistic objectives, identify participants and stakeholders, and choose appropriate scenarios and injects to test decision-making, coordination, communication and technical procedures. It emphasises the importance of clear roles (exercise director, facilitators, controllers, evaluators, observers), pre-exercise briefings and logistics planning. The guideline also covers data collection during the exercise, methods for structured observation and note-taking, and the role of debriefings and After Action Reviews. Finally, it outlines how to document results in an improvement plan, linking findings to corrective actions and follow-up responsibilities.",
    "exercise_use": "Use this document as a general, internationally recognised framework for structuring simulations and drills. When the user asks for a simulation-based exercise (especially in health or civil protection), align the design with its logic: clear objectives, appropriate choice of exercise type, roles and responsibilities, scenario and inject design, structured evaluation and follow-up. When generating conduct plans and AAR structures, adopt its emphasis on observation, debriefing and improvement planning."
  },
  {
    "id": "smartex_manual_emergency_exercises",
    "title": "Emergency Exercises – Operational Manual",
    "type": "internal_manual",
    "author": "Roberto Pizzi",
    "summary": "This proprietary manual presents a practical, operational approach to designing, conducting and evaluating emergency exercises in organisations, with particular attention to civil protection, business continuity and crisis management. It introduces the exercise lifecycle based on the PDCA logic and clearly distinguishes between preparation, conduct and evaluation phases. The manual describes different exercise formats (tabletop, drill, functional, full-scale) and how to choose between them according to objectives, resources and the maturity of the organisation. It provides concrete guidance on defining exercise objectives and capabilities to be tested, constructing realistic scenarios, developing a Master Events List (MEL) and building all necessary documentation such as player handbooks, controller/evaluator handbooks, checklists and inject templates. A strong focus is placed on governance and roles (project team, exercise director, controllers, evaluators, observers, participants), coordination meetings and project management aspects (scope, timing, budget, risks). The manual also explains how to collect evidence during the exercise, analyse performance, identify strengths and areas for improvement and formalise them in an After Action Report and improvement plan.",
    "exercise_use": "Use this manual as a core methodological reference for exercise design and management when no other specific framework is explicitly required by the user. Structure objectives, scenarios, MEL, documentation and evaluation according to its logic: clear separation of phases, explicit roles and responsibilities, a PDCA cycle and a strong link between objectives, scenario events and evaluation criteria. When the user requests complete exercise products (concept, scenarios, handbooks, checklists, AAR), align the structure and level of detail with the approach described here."
  },
  {
    "id": "evaluation_of_exercises",
    "title": "Evaluation of Exercises",
    "type": "evaluation_guideline",
    "author": "Swedish Civil Contingencies Agency (MSB)",
    "summary": "This document focuses on the evaluation phase of emergency exercises. It explains why evaluation is critical for learning, accountability and continuous improvement, and distinguishes between different evaluation purposes: validating plans and procedures, testing coordination mechanisms, assessing individual or team performance and identifying capability gaps. The text describes several evaluation methods, including direct observation, structured checklists, participant questionnaires, hot washes and analysis of decision logs and communications. It provides guidance on developing evaluation criteria and indicators that are specific, measurable and linked to exercise objectives. The document also illustrates how to organise an evaluation team, assign roles (lead evaluator, functional evaluators, observers) and ensure adequate independence and objectivity. It emphasises the importance of capturing data during the exercise, consolidating findings and formulating recommendations that have clear ownership and timelines. Finally, it covers how to draft an After Action Report that clearly presents strengths, areas for improvement, root causes and proposed corrective actions, as well as how to monitor the implementation of improvement measures over time.",
    "exercise_use": "Use this reference whenever the user asks for evaluation frameworks, evaluation plans, checklists for controllers and evaluators, or After Action Reports. Align indicators, evaluation questions and data collection methods with the principles described here. When proposing AAR structures or improvement plans, prioritise clarity of findings, explicit linkage between objectives and observations and actionable recommendations with responsibilities and timelines, in line with this document."
  },
  {
    "id": "cyber_exercise_handbook",
    "title": "Handbook Cyber Security Exercise",
    "type": "domain_specific_handbook",
    "author": "Swedish National Defence College (CATS)",
    "summary": "This handbook provides specific guidance for planning and conducting cyber security exercises. It starts by describing the particular nature of cyber incidents, such as ransomware attacks, data breaches, DDoS events and compromise of critical infrastructures, and explains how these incidents differ from conventional emergencies. The document introduces various types of cyber exercises, including discussion-based tabletop exercises focused on decision-making, technical simulations involving real or simulated systems and hybrid exercises combining strategic, operational and technical levels. It addresses how to define objectives that may range from testing incident response plans and SOC procedures to evaluating coordination between IT, security, legal, communications and top management. The handbook discusses scenario design for cyber incidents, including timelines of attacker actions, discovery, escalation, communication with stakeholders, engagement with regulators and media and technical response steps. It also covers specific roles (CISO, SOC analysts, incident manager, external partners) and special considerations such as data sensitivity, legal constraints and potential reputational impacts. Evaluation methods are adapted to the cyber context, focusing on detection and response times, quality of decision-making, completeness of logging and documentation and effectiveness of communication inside and outside the organisation.",
    "exercise_use": "Use this handbook as a specialised reference when the user is designing or evaluating cyber security exercises. When building scenarios, MELs or handbooks for cyber incidents, incorporate typical elements of cyber kill chains, detection and escalation paths and multi-stakeholder coordination described in this handbook. Align objectives and evaluation criteria with cyber-specific capabilities: incident detection, containment, eradication, recovery, communication and coordination between technical and non-technical actors."
  },
  {
    "id": "managing_exercises_handbook",
    "title": "Managing Exercises Handbook",
    "type": "practical_handbook",
    "author": "Australian Institute for Disaster Resilience",
    "summary": "This handbook offers a comprehensive, practical view on how to manage the entire lifecycle of exercises, from initial concept to follow-up. It explains the governance structure needed for a successful exercise programme, including the role of senior sponsors, steering groups, exercise directors and planning teams. The document emphasises the importance of setting a multi-year exercise strategy, balancing different exercise types and scopes over time. It provides detailed guidance on project management aspects: defining scope and constraints, building a planning timeline, managing resources, engaging stakeholders and controlling risks and changes. The handbook goes through each phase of an individual exercise: needs analysis, objective setting, design and scenario development, documentation, logistics, conduct, evaluation and improvement planning. It includes practical suggestions on communication with participants, safety and ethical considerations and managing expectations. The final sections emphasise institutional learning, the creation of exercise programmes rather than isolated events and the integration of exercise results into policy, planning and training systems.",
    "exercise_use": "Use this document as a general management reference when the user needs to set up an exercise programme, define governance or manage a complex exercise as a project. When the user asks about multi-year planning, stakeholder engagement or how to organise the planning team and steering structures, align suggestions with the principles and structures described in this handbook. When designing single exercises, apply its project management perspective: clear scope, realistic timeline, defined responsibilities and risk management."
  },
  {
    "id": "msb_exercise_guidance",
    "title": "MSB Exercise Guidance",
    "type": "national_guidance",
    "author": "Swedish Civil Contingencies Agency (MSB)",
    "summary": "This guidance, issued by a national civil contingencies agency, provides structured recommendations for planning, conducting and following up exercises at different levels of government and in critical sectors. It sets out the rationale for exercises as tools for preparedness, inter-agency coordination and societal resilience. The guidance describes various exercise formats and encourages organisations to select formats that match their objectives, maturity and resource constraints. It pays particular attention to inter-organisational and cross-sector exercises, highlighting challenges in coordination, decision-making, information sharing and situational awareness. Scenario design is addressed with emphasis on realism and relevance to national risk assessments, including cascading effects and cross-border considerations. The document also stresses the need for robust evaluation, including clear evaluation questions, use of observers and evaluators and systematic documentation of lessons identified. An important theme is the need to connect exercise findings to long-term capability development and to embed exercises in a broader preparedness cycle.",
    "exercise_use": "Use this guidance when the user represents public authorities or critical infrastructure operators, especially in multi-agency or regional exercises. When working in a national or local government context, align proposed exercise structures, inter-agency coordination mechanisms and scenario choices with the principles described here. Emphasise realistic risk-based scenarios, clear roles between organisations and strong links between exercise findings and capability development."
  },
  {
    "id": "pmbok_guide_7th",
    "title": "PMBOK 7th Edition",
    "type": "project_management_standard",
    "author": "Project Management Institute (PMI)",
    "summary": "The PMBOK Guide 7th Edition is a project management standard that shifts from a process-based view to a principles and performance domain approach. It introduces project management principles such as stewardship, team, stakeholders, value, systems thinking, leadership, tailoring, quality and adaptability. The guide organises project work into performance domains including stakeholders, team, development approach and life cycle, planning, project work, delivery, measurement and uncertainty. It emphasises that projects should deliver value and outcomes aligned with organisational strategy, and that approaches (predictive, agile, hybrid) should be tailored to the context. While not specific to exercises, the guide provides a robust framework for structuring an exercise as a project: defining objectives and value, engaging stakeholders, building an effective team, planning scope, schedule and resources, monitoring progress and managing risks. It also highlights the importance of feedback, continuous learning and adaptation based on measurement and evidence.",
    "exercise_use": "Use PMBOK as a general project management reference when the user needs to manage complex exercise projects or multi-year exercise programmes. When questions concern planning timelines, stakeholder engagement, risk management or how to treat an exercise as a project, align the advice with PMBOK principles and performance domains. Emphasise value delivery (improving preparedness and capabilities), stakeholder engagement, iterative planning and learning, and the need to tailor the exercise approach to organisational context and constraints."
  },
  {
    "id": "hseep_volume_i",
    "title": "HSEEP Volume I – Overview and Exercise Program Management",
    "type": "public_guideline",
    "author": "U.S. Department of Homeland Security (DHS)",
    "summary": "HSEEP Volume I covers the management of an exercise programme and the planning of individual exercises, with a focus on homeland security and emergency preparedness. It introduces the concept of a progressive, multi-year exercise programme aligned with preparedness priorities and capability targets. The document describes how to develop an exercise programme management plan, identify stakeholders and partners, and coordinate across agencies and jurisdictions. For individual exercises, it lays out the key planning milestones and core planning team roles. It explains how to develop exercise objectives that are linked to core capabilities, design scenarios that support those objectives, and plan logistics, communications and safety. The guidance includes standard HSEEP templates and terminology for exercise documentation, such as the Concept and Objectives (C&O) meeting, Initial Planning Meeting (IPM), Master Scenario Events List (MSEL), and key documents like the Exercise Plan (ExPlan) and Controller and Evaluator Handbook (C/E Handbook).",
    "exercise_use": "Use HSEEP Volume I as a major reference when the user needs structured, programme-based exercise planning, particularly in emergency management and homeland security contexts. Align descriptions of exercise programmes, planning milestones, document sets and roles with HSEEP terminology when this is appropriate for the user. When generating concepts of exercise, planning timelines or document outlines, you can mirror HSEEP structures (e.g. C&O meeting, IPM, MSEL) while clearly stating that this is an alignment, not a formal certification."
  },
  {
    "id": "hseep_volume_ii",
    "title": "HSEEP Volume II – Exercise Planning and Conduct",
    "type": "public_guideline",
    "author": "U.S. Department of Homeland Security (DHS)",
    "summary": "HSEEP Volume II focuses on the detailed design and development of exercises. It provides step-by-step guidance on translating objectives and core capabilities into exercise design decisions: exercise type, scope, participants, locations and duration. The document offers detailed instructions and examples for constructing the Master Scenario Events List (MSEL), including event types, injects, expected player actions, controller instructions and evaluation criteria. It explains how to write clear, realistic injects and how to sequence them over time to create a coherent narrative and appropriate workload for players. Additionally, it addresses the development of exercise documentation such as Situation Manuals (SitMan), Exercise Plans (ExPlan) and handbooks for controllers and evaluators. The volume also discusses coordination between design, logistics and evaluation teams to ensure that the exercise is both feasible and effective for learning.",
    "exercise_use": "Use HSEEP Volume II as a detailed reference whenever the user asks for help designing scenarios, MSELs/MELs and exercise documentation for discussion-based or operations-based exercises. When generating MELs, inject lists, player handbooks or controller/evaluator handbooks, adopt the logic and structure described here: clear linkage between objectives and injects, explicit expected player actions and integrated evaluation considerations. Explain, when useful, how the proposed MEL structure relates to recognised HSEEP practice."
  },
  {
    "id": "hseep_volume_iii",
    "title": "HSEEP Volume III – Exercise Evaluation and Improvement Planning",
    "type": "public_guideline",
    "author": "U.S. Department of Homeland Security (DHS)",
    "summary": "HSEEP Volume III covers the evaluation and improvement planning components of the HSEEP cycle. It describes how to organise evaluation teams, assign evaluator roles, and prepare evaluation tools such as data collection forms, observation checklists and evaluation guides. The document explains the process of conducting data collection during exercises, including observation techniques, documentation of key actions and decisions, and the use of hot washes and participant feedback forms. It then details the steps to analyse the collected data, identify strengths and areas for improvement, and develop improvement plans. A central product in this volume is the After Action Report/Improvement Plan (AAR/IP), which consolidates findings, recommended corrective actions, responsible parties and timelines. The document stresses the need to integrate improvement planning into broader preparedness and planning cycles so that exercises contribute to long-term capability development.",
    "exercise_use": "Use HSEEP Volume III as a primary reference when the user seeks support for evaluation plans, evaluator tools and AARs. When generating AAR outlines, evaluation matrices or improvement plans, align with the HSEEP logic: clear connection between objectives, observations, findings and corrective actions, with assigned responsibilities and timelines. Encourage users to treat evaluation not as a formality but as a key driver for continuous improvement in preparedness and capabilities."
  },
  {
    "id": "iaea_exercise_manual",
    "title": "Preparation, Conduct and Evaluation of Exercises to Test Preparedness for a Nuclear or Radiological Emergency",
    "type": "domain_specific_manual",
    "author": "International Atomic Energy Agency (IAEA)",
    "summary": "This manual provides detailed guidance for the development and implementation of emergency response exercises related to nuclear and radiological events. It describes the international context and IAEA requirements for preparedness and response, and explains how exercises support the validation of plans, procedures and capabilities in this highly specialised domain. The document classifies different types of exercises (from drills to full-scale), discusses specific roles and responsibilities of operators, regulators, emergency services and technical support organisations, and emphasises the importance of coordination at local, national and international levels. Scenario design is tailored to radiological and nuclear hazards, including facility accidents, transport incidents and malicious acts, with attention to protective actions, public information, monitoring, dose assessment and medical response. Evaluation approaches are described with focus on technical performance, decision-making quality, adherence to international safety standards and communication with the public and international bodies.",
    "exercise_use": "Use this manual as a specialised reference when the user operates in the context of nuclear or radiological emergency exercises. When appropriate, incorporate its logic into scenario design (types of radiological events, protective actions, communication challenges) and into evaluation criteria (technical performance, decision-making, coordination with authorities and international organisations). Make clear that alignment is with IAEA principles and guidance, and that formal compliance requires review against the full manual and applicable regulations."
  },
  {
    "id": "pm2_methodology",
    "title": "PM² Project Management Methodology - Guide 3.1",
    "type": "project_management_methodology",
    "author": "European Commission – CoEPM²",
    "summary": "PM² is a project management methodology developed by the European Commission, designed to be simple, lean and easy to apply across different types of projects. It combines governance structure, lifecycle phases, processes and artefacts, and provides clear roles and responsibilities. The methodology defines a project lifecycle consisting of initiation, planning, execution and closure, supported by monitoring and control. It places strong emphasis on stakeholder engagement, risk management, quality assurance and communication. PM² introduces specific roles (such as the Project Owner, Business Manager, Project Manager, Solution Provider) and artefacts (e.g. Project Charter, Business Case, Project Handbook, Status Reports) to ensure that projects are well framed and managed. Although not specific to emergency exercises, its structure is easily applicable to exercise projects and programmes, providing a disciplined approach to planning, documenting and controlling work.",
    "exercise_use": "Use PM² as an alternative or complementary project management framework when the user works in contexts familiar with EU methodologies or wants a clear governance and lifecycle model. When the user asks for help structuring an exercise as a project, propose PM²-style artefacts (charter, plan, status reports) and governance (project owner, steering body, project manager), adapted to the exercise context. Emphasise stakeholder engagement, risk and quality management and a clear lifecycle from initiation to closure, ensuring that exercise planning and evaluation are treated as formal project phases."
  }
]
